       IDENTIFICATION DIVISION.
       PROGRAM-ID. DAY-01-PART-01.
       AUTHOR. ALEJANDRO VILLANUEVA.

       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       SOURCE-COMPUTER. MAC OS X.

       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
           SELECT NOT OPTIONAL INPUT-FILE ASSIGN TO DISK "INPUT.TXT"         
           ORGANIZATION IS LINE SEQUENTIAL.

       DATA DIVISION.
       FILE SECTION.
       FD  INPUT-FILE.
       01  INPUT-LINE PIC X(80).

       WORKING-STORAGE SECTION.
       77  DIGITS PIC X(9) VALUE "123456789".
       77  CHAR-POS PIC 99.
       77  CHAR-COUNT PIC 99.                                            
       77  END-COUNT PIC 99.
       77  FIRST-DIGIT PIC 9.
       77  LAST-DIGIT PIC 9.
       77  CALIBRATION-VALUE PIC 99.                         
       77  TOTAL-CALIBRATION-VALUE PIC 999999 VALUE ZERO.

       PROCEDURE DIVISION.
       BEGIN.
           OPEN INPUT INPUT-FILE
           PERFORM GET-LINES
           CLOSE INPUT-FILE
           STOP RUN.

       GET-LINES.
           READ INPUT-FILE
               AT END MOVE HIGH-VALUES TO INPUT-LINE
           END-READ
           PERFORM UNTIL INPUT-LINE = HIGH-VALUES
               PERFORM PROCESS-LINE                                             
               READ INPUT-FILE
                   AT END MOVE HIGH-VALUES TO INPUT-LINE
               END-READ
           END-PERFORM
           DISPLAY "TOTAL CALIBRATION VALUE: " TOTAL-CALIBRATION-VALUE.

       PROCESS-LINE.
           MOVE 80 TO END-COUNT
           PERFORM VARYING CHAR-POS FROM 1 BY 1 UNTIL CHAR-POS > 9
               MOVE 1 TO CHAR-COUNT
               INSPECT INPUT-LINE TALLYING CHAR-COUNT FOR CHARACTERS
                   BEFORE INITIAL DIGITS(CHAR-POS:1)
               IF CHAR-COUNT < END-COUNT
                   MOVE CHAR-COUNT TO END-COUNT   
               END-IF
           END-PERFORM
           MOVE INPUT-LINE(END-COUNT:1) TO FIRST-DIGIT                     

           MOVE 0 TO END-COUNT
           PERFORM VARYING CHAR-POS FROM 1 BY 1 UNTIL CHAR-POS > 9
               PERFORM VARYING CHAR-COUNT FROM 80 BY -1
               UNTIL CHAR-COUNT = 0
                   IF INPUT-LINE(CHAR-COUNT:1) EQUALS DIGITS(CHAR-POS:1)
                   AND CHAR-COUNT > END-COUNT
                       MOVE CHAR-COUNT TO END-COUNT                 
                   END-IF
               END-PERFORM
           END-PERFORM
           MOVE INPUT-LINE(END-COUNT:1) TO LAST-DIGIT

           COMPUTE CALIBRATION-VALUE = 10 * FIRST-DIGIT + LAST-DIGIT
           DISPLAY CALIBRATION-VALUE ": " INPUT-LINE
           ADD CALIBRATION-VALUE TO TOTAL-CALIBRATION-VALUE.
